Revit 2027 API
FaceIntersectionFaceResult Enumeration
 An enumerated type listing the possible results of a face-face intersection calculation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FaceIntersectionFaceResult
Public Enumeration FaceIntersectionFaceResult
public enum class FaceIntersectionFaceResult
type FaceIntersectionFaceResult
Members
Member name | Value | Description
Intersecting | 0 |  The two faces have an intersection.
NonIntersecting | 1 |  The two faces have no intersection.
See Also
Reference
Autodesk.Revit.DB Namespace